<a href="https://colab.research.google.com/github/Deepanshu1908/DataScience_Python/blob/main/Salary_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [4]:
#Read csv file
df = pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

In [5]:
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [14]:
df.head(2)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [15]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [16]:
df.shape

(78, 6)

In [19]:
df.ndim

2

In [20]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [22]:
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [23]:
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [25]:
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [27]:
df.mode()

   rank discipline  phd  service     sex   salary
0  Prof          B  4.0      3.0  Female  92000.0
1   NaN        NaN  NaN      NaN    Male      NaN

In [28]:
df.median()

phd            18.5
service        14.5
salary     104671.0
dtype: float64

In [31]:
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [33]:
df.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [34]:
df1 = df.head(50)

In [36]:
df1.mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [40]:
df.rank()

    rank  discipline   phd  service   sex  salary
0   55.5        57.5  78.0     77.0  59.0    78.0
1   55.5        18.5  25.0     22.0  59.0    29.0
2   55.5        18.5  50.5     57.0  59.0    48.0
3   55.5        18.5  74.0     70.5  59.0    63.0
4   55.5        57.5  44.0     47.0  59.0    40.0
..   ...         ...   ...      ...   ...     ...
73  55.5        57.5  37.5     34.0  20.0    42.0
74   7.0        57.5  40.5     22.0  20.0    39.0
75  55.5        57.5  33.0     43.0  20.0    57.0
76  55.5        18.5  60.0     38.5  20.0    47.0
77  55.5        18.5  50.5     40.5  20.0    45.0

[78 rows x 6 columns]

In [41]:
df2 = df['phd']

In [43]:
df2.describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [45]:
df2.shape

(78,)

In [46]:
df2.count()

78